IRP/src/DataProcessors/FillingNewAreaAssistant/FillingNewAreaAssistant.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>FillingNewAreaAssistant</name>
  <attributes>
    <name>Area</name>
    <type>
      <types>CatalogRef.DataAreas</types>
    </type>
  </attributes>
  <attributes>
    <name>CompanyName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalName</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>CompanyLocalization</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CompanyType</name>
    <type>
      <types>CatalogRef.CompanyTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>DownloadRateType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CurrencyRateIntegrationSettings</name>
    <type>
      <types>CatalogRef.IntegrationSettings</types>
    </type>
  </attributes>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.Countries</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <tabularSections>
    <name>CreatedCurrencies</name>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CreatedCashAccounts</name>
    <attributes>
      <name>CashAccount</name>
      <type>
        <types>CatalogRef.CashAccounts</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CreatedBankAccounts</name>
    <attributes>
      <name>CashAccount</name>
      <type>
        <types>CatalogRef.CashAccounts</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

IRP/src/InformationRegisters/UserSettings/UserSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>UserSettings</name>
  <resources>
    <name>KindOfAttribute</name>
    <type>
      <types>EnumRef.KindsOfAttributes</types>
    </type>
  </resources>
  <resources>
    <name>Value</name>
    <type>
      <types>Number</types>
      <types>String</types>
      <types>Date</types>
      <types>Boolean</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>UserOrGroup</name>
    <type>
      <types>CatalogRef.Users</types>
      <types>CatalogRef.UserGroups</types>
    </type>
  </dimensions>
  <dimensions>
    <name>MetadataObject</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>AttributeName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IRP/src/Enums/KindsOfAttributes/KindsOfAttributes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>KindsOfAttributes</name>
  <enumValues>
    <name>Standard</name>
  </enumValues>
  <enumValues>
    <name>Regular</name>
  </enumValues>
  <enumValues>
    <name>Common</name>
  </enumValues>
  <enumValues>
    <name>Additional</name>
  </enumValues>
  <enumValues>
    <name>TabularSection</name>
  </enumValues>
  <enumValues>
    <name>Column</name>
  </enumValues>
  <enumValues>
    <name>Custom</name>
  </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/ItemTypes/ItemTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ItemTypes</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.ItemTypes</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AvailableAttributes</name>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>AffectPricing</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Required</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ShowInHTML</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/AccessProfiles/AccessProfiles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AccessProfiles</name>
  <tabularSections>
    <name>Roles</name>
    <attributes>
      <name>Role</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Configuration</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/AccessGroups/AccessGroups.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AccessGroups</name>
  <tabularSections>
    <name>Profiles</name>
    <attributes>
      <name>Profile</name>
      <type>
        <types>CatalogRef.AccessProfiles</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Users</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/ObjectStatuses/ObjectStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ObjectStatuses</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>SalesOrder</name>
      <description>Sales order</description>
    </items>
    <items>
      <name>SalesReturnOrder</name>
      <description>Sales return order</description>
    </items>
    <items>
      <name>PurchaseOrder</name>
      <description>Purchase order</description>
    </items>
    <items>
      <name>PurchaseReturnOrder</name>
      <description>Purchase return order</description>
    </items>
    <items>
      <name>InventoryTransferOrder</name>
      <description>Inventory transfer order</description>
    </items>
    <items>
      <name>OutgoingPaymentOrder</name>
      <description>Outgoing payment order</description>
    </items>
    <items>
      <name>ReconciliationStatement</name>
      <description>Reconciliation statement</description>
    </items>
    <items>
      <name>ChequeBondTransaction</name>
      <description>Cheque bond transaction</description>
    </items>
  </predefined>
  <attributes>
    <name>SetByDefault</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Posting</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PostingAdvanced</name>
    <type>
      <types>EnumRef.DocumentPostingTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>PostingPartnerAccountTransactions</name>
    <type>
      <types>EnumRef.DocumentPostingTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>PostingReconciliationStatement</name>
    <type>
      <types>EnumRef.DocumentPostingTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>PostingAccountBalance</name>
    <type>
      <types>EnumRef.DocumentPostingTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>PostingPlaningCashTransactions</name>
    <type>
      <types>EnumRef.DocumentPostingTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>PostingChequeBondBalance</name>
    <type>
      <types>EnumRef.DocumentPostingTypes</types>
    </type>
  </attributes>
  <tabularSections>
    <name>NextPossibleStatuses</name>
    <attributes>
      <name>Status</name>
      <type>
        <types>CatalogRef.ObjectStatuses</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/DataProcessors/FillingNewAreaAssistant/ManagerModule.bsl
Procedure CreateDefaultObjects() Export	
	KeyAttribute = "Description_en";
	LangCodeEn   = "en";     
	
	// Default Price types
	FillingFromClassifiers.CreateCatalogItemFromClassifier("Catalog.PriceTypes", 
							KeyAttribute, 
							R(LangCodeEn).Class_001);
	FillingFromClassifiers.CreateCatalogItemFromClassifier("Catalog.PriceTypes", 
							KeyAttribute, 
							R(LangCodeEn).Class_002);
	FillingFromClassifiers.CreateCatalogItemFromClassifier("Catalog.PriceTypes", 
							KeyAttribute, 
							R(LangCodeEn).Class_003);
		
	// Item types
	FillingFromClassifiers.CreateCatalogItemFromClassifier("Catalog.ItemTypes", 
							KeyAttribute, 
							R(LangCodeEn).Class_004);
	FillingFromClassifiers.CreateCatalogItemFromClassifier("Catalog.ItemTypes", 
							KeyAttribute, 
							R(LangCodeEn).Class_005);
		
	// Main store
	MainStore = FillingFromClassifiers.CreateCatalogItemFromClassifier("Catalog.Stores", 
							KeyAttribute, 
							R(LangCodeEn).Class_006);
		
	// Main Manager
	FillingFromClassifiers.CreateCatalogItemFromClassifier("Catalog.PartnerSegments", 
							KeyAttribute, 
							R(LangCodeEn).Class_007);
							
	// Default Unit pcs
	FillingFromClassifiers.CreateCatalogItemFromClassifier("Catalog.Units", 
							KeyAttribute, 
							R(LangCodeEn).Class_008);
							
	// Object statuses
	CreateDefaultObjectStatuses();	
	
	
	// User settings
	FillDefaultUserSettings(New Structure("Store", MainStore));
	
EndProcedure

Procedure CreateAdminAccessGroup(AdminUser) Export	
	
	// Profile
	ProfileObject = Catalogs.AccessProfiles.CreateItem();
	DescriptionStructure = FillingFromClassifiers.DescriptionStructure("Admin");
	FillPropertyValues(ProfileObject, DescriptionStructure);
	NewRow = ProfileObject.Roles.Add();
	NewRow.Role          = "FullAccess";
	NewRow.Configuration = "IRP";
	NewRow = ProfileObject.Roles.Add();
	NewRow.Role          = "RunWebClient";
	NewRow.Configuration = "IRP";
	ProfileObject.Write();
	
	// Access group
	AccessGroupObject = Catalogs.AccessGroups.CreateItem();
	DescriptionStructure = FillingFromClassifiers.DescriptionStructure("Admin");
	FillPropertyValues(AccessGroupObject, DescriptionStructure);
	
	AccessGroupObject.Profiles.Add().Profile = ProfileObject.Ref;
	
	AccessGroupObject.Users.Add().User = AdminUser;
	AccessGroupObject.Write();
	
EndProcedure

Procedure CreateDefaultObjectStatuses()
	// Object statuses
	ParentsArray = New Array;
	ParentsArray.Add(Catalogs.ObjectStatuses.InventoryTransferOrder);
	ParentsArray.Add(Catalogs.ObjectStatuses.OutgoingPaymentOrder);
	ParentsArray.Add(Catalogs.ObjectStatuses.PurchaseOrder);
	ParentsArray.Add(Catalogs.ObjectStatuses.PurchaseReturnOrder);
	ParentsArray.Add(Catalogs.ObjectStatuses.ReconciliationStatement);
	ParentsArray.Add(Catalogs.ObjectStatuses.SalesOrder);
	ParentsArray.Add(Catalogs.ObjectStatuses.SalesReturnOrder);
	
	// Status Draft
	ClassifierElementDraft = FillingFromClassifiers.GetElementFromClassifier("Catalog.ObjectStatuses", 
							"Description_en", "Draft");
	If ClassifierElementDraft <> Undefined Then
		For Each StatusParent In ParentsArray Do
			ClassifierElementDraft.Insert("Parent", StatusParent);
			FillingFromClassifiers.CreateCatalogItemFromClassifierElement(
										"Catalog.ObjectStatuses", ClassifierElementDraft);	
		EndDo;
	EndIf;
	
	// Status Approved 
	ClassifierElementApproved = FillingFromClassifiers.GetElementFromClassifier("Catalog.ObjectStatuses", 
							"Description_en", "Approved");
	If ClassifierElementApproved <> Undefined Then
		For Each StatusParent In ParentsArray Do
			ClassifierElementApproved.Insert("Parent", StatusParent);
			FillingFromClassifiers.CreateCatalogItemFromClassifierElement(
										"Catalog.ObjectStatuses", ClassifierElementApproved);	
		EndDo;
	EndIf;
EndProcedure

Procedure FillDefaultUserSettings(DefaultValues) Export
	InfoRegMetadata = Metadata.InformationRegisters.UserSettings;
	TableOfSettings = New ValueTable();
	TableOfSettings.Columns.Add("MetadataObject", InfoRegMetadata.Dimensions.MetadataObject.Type);
	TableOfSettings.Columns.Add("AttributeName", InfoRegMetadata.Dimensions.AttributeName.Type);
	TableOfSettings.Columns.Add("Value", InfoRegMetadata.Resources.Value.Type);
	TableOfSettings.Columns.Add("KindOfAttribute", InfoRegMetadata.Resources.KindOfAttribute.Type);
	
	For Each MetadataObject In Metadata.Documents Do
		For Each Attribute In MetadataObject.Attributes Do
			If Not DefaultValues.Property(Attribute.Name)
					OR  Not AccessRight("View", Attribute, Metadata.Roles.FilterForUserSettings) Then
				Continue;
			EndIf;
			
			NewRow = TableOfSettings.Add();
			NewRow.MetadataObject  = MetadataObject.FullName();
			NewRow.AttributeName   = Attribute.Name;
			NewRow.Value           = DefaultValues[Attribute.Name];
			NewRow.KindOfAttribute = Enums.KindsOfAttributes.Regular;
		EndDo;
	EndDo;
	
	Query = New Query(
	"SELECT
	|	Table.MetadataObject,
	|	Table.AttributeName,
	|	Table.Value,
	|	Table.KindOfAttribute
	|into tmp
	|FROM
	|	&TableOfSettings AS Table
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	UserGroups.Ref AS UserOrGroup,
	|	tmp.MetadataObject,
	|	tmp.AttributeName,
	|	tmp.Value,
	|	tmp.KindOfAttribute
	|FROM
	|	Catalog.UserGroups AS UserGroups,
	|	tmp AS tmp
	|WHERE
	|	NOT UserGroups.DeletionMark");
	Query.SetParameter("TableOfSettings", TableOfSettings);
	Selection = Query.Execute().Select();
	While Selection.Next() Do
		RecordManager = InformationRegisters.UserSettings.CreateRecordManager();
		FillPropertyValues(RecordManager, Selection);
		RecordManager.Write();
	EndDo;
	
EndProcedure
